# Accuracy Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidOrShellTessellationControls..::..Accuracy Property
SolidOrShellTessellationControls Class See Also
---
A positive real number specifying how accurately a triangulation should approximate a solid or shell.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Accuracy { get; set; }
```

Visual Basic
---
```text
Public Property Accuracy As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Accuracy {
	double get ();
	void set (double value);
}
```

# Remarks
The maximum distance from a point on the triangulation to the nearest point on the solid or shell should be no greater than the specified accuracy. This constraint may be approximately enforced.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for accuracy must be greater than 0 and no more than 30000 feet. |

# See Also
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace